posts/window-managers.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-01-30 Tue 14:53 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Window Managers</title>
<meta name="generator" content="Org mode">
</head>
<body>
<div id="preamble" class="status">
<link rel="stylesheet" type="text/css" href="/stylesheet.css"/>

<p align="right">
<a class="active" href="/"></a> |
<a href="/posts/">Posts</a> |
<a href="/snippets/">Snippets</a> |
<a href="/repository.html">Repository</a> |
<a href="/about.html">About</a> |
<a href="/rss.xml"> rss </a>
</p>
</div>
<div id="content">
<header>
<h1 class="title">Window Managers</h1>
</header><p>
Desktop Environment gives us everything we would like to operate on Desktop with care towards UI and UX, that matches the common paradigm. It is a lot driven by mouse, and seems to fairly make work simpler and easier. It is not like keyboard can always make task quicker, mouse can be ahead of the race.
</p>

<p>
But I too followed the trend to ditch mouse and embrace the swiftness of keyboard. I like to hear the &ldquo;clicks&rdquo; and &ldquo;tacks&rdquo;.
</p>

<p>
Window Managers are tools which only manage the window alignment and their behavior, with wayland, the compositor acts as both display server and window manager. Typically tho window managers offer keyboard focused, tweakable configuration to suit user&rsquo;s need, but alas it does work for minimal sake, just does offer on managing windows and thats it. It is not a Desktop environment to facilitate for other needs.
</p>

<p>
After fairly using a lot of window manager, from X11 days to now Wayland years, I stick with window managers only. It gives the feel of unique, self owned customization. My system can only be used by me, how cool !
</p>

<p>
Back in X11 days, I started with Cinnamon (Linux Mint) and later moved to XFCE to conserve Ram usage. Both were very good, Xfce was very much customization. Later I fell in the rabbit hole for more minimalism, and started looking at Youtube videos and came along the road of Window Managers.
</p>

<p>
Tried with <code>i3wm</code>, and boyo boy, it worked and made the workflow like charm, and again I feel into another rabbit hole of World of window managers. The cost I had to pay was, endless customization for my needs, and wasting time. After fair usage, with some free time (pandemic age) I tried out other WMs, like <code>dwm</code>, <code>leftwm</code>, <code>Qtile</code> &amp; <code>bspwm</code> and used them all fairly equally and it was done.
</p>

<p>
With wayland years, I soon discovered <code>sway</code> was popular and drop-in replacement, so was suite of apps needed to replacement for pure wayland integration. Soon listed some and move to <code>sway</code> ship, and reddit showed beautiful blur and animations of <code>hyprland</code>, and finally I settled on with <code>Hyprland</code>.
</p>

<p>
So far I have only listen WMs names, and I have not spoken of personal usage and feeling towards each of them, cause, they all just do one thing and they do it well. So except for config file (syntax), there is not much difference for user who wants to use laptop and &ldquo;<b>do the work</b>&rdquo;. It is a wonderful change to stick with WM, cause easy management of windows and minimal way of using the system, so I can use the saving part for demanding tasks.
</p>

<p>
One peculiar, and best thing WMs offer are Workspace. Which acts like spaces where windows are placed or configured, we get 10 (typically enough) or even more to organize and use our application in a handy way.
</p>

<p>
Closing words, Window Managers are definitely great, and changing enhancement, users (linux) should give it a try at least once, of course it&rsquo;s not for everyone, but how can anyone tell unless if they have not even tried. It can enhance the workflow for many, and can be worse for others.
</p>

<p>
So, just have a share of trial, explore and relax!
</p>
</div>
<div id="postamble" class="status">
<br><br>
<!-- <p class="date" id="content" align="left" style="font-size:0.8em;">Posted on: 2024-01-03 Wed 00:00 -->
<!--   <br> -->
<!--  Updated on: 2024-01-30 Tue 14:53 -->
<!-- </p> -->

<p align="center" style="font-size:0.7em;">
<br>
- - - - - - -  - - - - - - -  - - - - - - -  - - - - - - -
<br><br>
 2023 - 2024 <b>Dilip</b>  Made with 󰣐  using <a href="https://orgmode.org/">Org-mode</a> &amp; <a href="https://www.gnu.org/software/emacs/">Emacs</a>
<br>
The <a href="https://github.com/idlip/idlip.github.io">code</a> for this site is licensed under the <a href="https://www.gnu.org/licenses/gpl-3.0.en.html">GPLv3</a>, and the content is licensed under <a href="https://creativecommons.org/licenses/by-sa/4.0/">CC-BY-SA 4.0</a>
</p>

<!-- with org convert -->

<!-- #+attr_html: :align center :style font-size:0.7em; -->
<!-- Made with 󰣐  using [[https://orgmode.org][Org-mode]] & [[https://www.gnu.org/software/emacs/][Emacs]] -->
<!-- The [[https://github.com/idlip/idlip.github.io][code]] for this site is licensed under the [[https://www.gnu.org/licenses/gpl-3.0.en.html][GPLv3]], and the content is licensed under [[https://creativecommons.org/licenses/by-sa/4.0/][CC-BY-SA 4.0]] -->
</div>
</body>
</html>
